### Terraform `plan` Succeeded for Workspace: `default`
  
<details open><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # azurerm_resource_group.storage_rg will be created
+   resource "azurerm_resource_group" "storage_rg" {
+       id       = (known after apply)
+       location = "southcentralus"
+       name     = "it-ae-training-github-actions-001-bedge"
    }

  # azurerm_storage_account.training_sa will be created
+   resource "azurerm_storage_account" "training_sa" {
+       access_tier                       = (known after apply)
+       account_kind                      = "StorageV2"
+       account_replication_type          = "GRS"
+       account_tier                      = "Standard"
+       allow_nested_items_to_be_public   = true
+       cross_tenant_replication_enabled  = true
+       default_to_oauth_authentication   = false
+       enable_https_traffic_only         = true
+       id                                = (known after apply)
+       infrastructure_encryption_enabled = false
+       is_hns_enabled                    = false
+       large_file_share_enabled          = (known after apply)
+       location                          = "southcentralus"
+       min_tls_version                   = "TLS1_2"
+       name                              = "tamughtrnbedge"
+       nfsv3_enabled                     = false
+       primary_access_key                = (sensitive value)
+       primary_blob_connection_string    = (sensitive value)
+       primary_blob_endpoint             = (known after apply)
+       primary_blob_host                 = (known after apply)
+       primary_connection_string         = (sensitive value)
+       primary_dfs_endpoint              = (known after apply)
+       primary_dfs_host                  = (known after apply)
+       primary_file_endpoint             = (known after apply)
+       primary_file_host                 = (known after apply)
+       primary_location                  = (known after apply)
+       primary_queue_endpoint            = (known after apply)
+       primary_queue_host                = (known after apply)
+       primary_table_endpoint            = (known after apply)
+       primary_table_host                = (known after apply)
+       primary_web_endpoint              = (known after apply)
+       primary_web_host                  = (known after apply)
+       public_network_access_enabled     = true
+       queue_encryption_key_type         = "Service"
+       resource_group_name               = "it-ae-training-github-actions-001-bedge"
+       secondary_access_key              = (sensitive value)
+       secondary_blob_connection_string  = (sensitive value)
+       secondary_blob_endpoint           = (known after apply)
+       secondary_blob_host               = (known after apply)
+       secondary_connection_string       = (sensitive value)
+       secondary_dfs_endpoint            = (known after apply)
+       secondary_dfs_host                = (known after apply)
+       secondary_file_endpoint           = (known after apply)
+       secondary_file_host               = (known after apply)
+       secondary_location                = (known after apply)
+       secondary_queue_endpoint          = (known after apply)
+       secondary_queue_host              = (known after apply)
+       secondary_table_endpoint          = (known after apply)
+       secondary_table_host              = (known after apply)
+       secondary_web_endpoint            = (known after apply)
+       secondary_web_host                = (known after apply)
+       sftp_enabled                      = false
+       shared_access_key_enabled         = true
+       table_encryption_key_type         = "Service"

+       static_website {
+           error_404_document = "404.html"
+           index_document     = "index.html"
        }
    }

  # azurerm_storage_blob.training_content_blobs["../web_content/404.html"] will be created
+   resource "azurerm_storage_blob" "training_content_blobs" {
+       access_tier            = (known after apply)
+       content_md5            = "8180a475b7c2faae5d050da9a128b3a2"
+       content_type           = "text/html"
+       id                     = (known after apply)
+       metadata               = (known after apply)
+       name                   = "404.html"
+       parallelism            = 8
+       size                   = 0
+       source                 = "../web_content/404.html"
+       storage_account_name   = "tamughtrnbedge"
+       storage_container_name = "$web"
+       type                   = "Block"
+       url                    = (known after apply)
    }

  # azurerm_storage_blob.training_content_blobs["../web_content/index.html"] will be created
+   resource "azurerm_storage_blob" "training_content_blobs" {
+       access_tier            = (known after apply)
+       content_md5            = "af992460659db657d3d14a1f78e90e43"
+       content_type           = "text/html"
+       id                     = (known after apply)
+       metadata               = (known after apply)
+       name                   = "index.html"
+       parallelism            = 8
+       size                   = 0
+       source                 = "../web_content/index.html"
+       storage_account_name   = "tamughtrnbedge"
+       storage_container_name = "$web"
+       type                   = "Block"
+       url                    = (known after apply)
    }

Plan: 4 to add, 0 to change, 0 to destroy.
```
</details>
  